/* Non-user-facing error text for a connection that has been closed due to a timeout. */
"GCDAsyncSocketClosedError" = "소켓이 원격피어에 의해 닫힘";

/* Non-user-facing error text for an attempted connection that has failed due to a timeout. */
"GCDAsyncSocketConnectTimeoutError" = "호스트와의 연결 시도가 시간초과 되었습니다.";

/* No comment provided by engineer. */
"GCDAsyncSocketOtherError" = "소켓 FD에서 소켓 생성 시도 실패. getpeername() 실패";

/* Non-user-facing error text for a read operation that has read the maximum amount of allowed data. */
"GCDAsyncSocketReadMaxedOutError" = "읽기 작업이 설정된 최대 길이에 도달했습니다.";

/* Non-user-facing error text for a read operation that has failed due to a timeout. */
"GCDAsyncSocketReadTimeoutError" = "읽기 작업이 시간초과 되었습니다.";

/* Non-user-facing error text for a write operation that has failed due to a timeout. */
"GCDAsyncSocketWriteTimeoutError" = "쓰기 작업이 시간초과 되었습니다.";

